APC异步过程调用
----

1.分类

内核APC  {普通内核APC，加急内核APC}

用户APC


2.结构

在内核中有个APC链表，里面装了KAPC结构，这个结构与线程密切相关

      kd> dt _KAPC
      ntdll!_KAPC
         //类型
         +0x000 Type             : UChar
         +0x001 SpareByte0       : UChar
         //尺寸
         +0x002 Size             : UChar
         +0x003 SpareByte1       : UChar
         +0x004 SpareLong0       : Uint4B
         //当前线程
         +0x008 Thread           : Ptr32 _KTHREAD
         //APC链表
         +0x00c ApcListEntry     : _LIST_ENTRY
         //内核函数
         +0x014 KernelRoutine    : Ptr32     void 
         +0x018 RundownRoutine   : Ptr32     void 
         //函数
         +0x01c NormalRoutine    : Ptr32     void 
         //3个参数
         +0x020 NormalContext    : Ptr32 Void
         +0x024 SystemArgument1  : Ptr32 Void
         +0x028 SystemArgument2  : Ptr32 Void
         //APC状态索引
         +0x02c ApcStateIndex    : Char
         //APC模式，判断用户APC还是内核APC
         +0x02d ApcMode          : Char
         //判断这个APC是否曾经被插入过
         +0x02e Inserted         : UChar

线程结构中与APC有关的成员

        //状态
        +0x040 ApcState         : _KAPC_STATE
        //关闭内核APC的执行
        +0x084 KernelApcDisable : Int2B
        +0x086 SpecialApcDisable : Int2B
        +0x084 CombinedApcDisable : Uint4B
        //APC队列是否允许插入
        +0x0b8 ApcQueueable     : Pos 5, 1 Bit
        //索引 挂靠的时候，Index为1，没挂靠的时候，Index为0
        +0x134 ApcStateIndex    : UChar
        //当ApcStateIndex=1，APC状态就是ApcStatePointer[1].当ApcStateIndex=0，APC状态就是ApcStatePointer[0]
        //ApcStatePointer[0]指向0x40的APC状态，ApcStatePointer[1]指向0x170的保存状态
        +0x168 ApcStatePointer  : [2] Ptr32 _KAPC_STATE
        //保存状态
        +0x170 SavedApcState    : _KAPC_STATE


        kd>  dt _KAPC_STATE
        ntdll!_KAPC_STATE
           //ApcListHead[0]为内核APC链表，ApcListHead[1]为用户APC链表
           +0x000 ApcListHead      : [2] _LIST_ENTRY
           //挂靠进程
           +0x010 Process          : Ptr32 _KPROCESS
           +0x014 KernelApcInProgress : UChar
           +0x015 KernelApcPending : UChar
           +0x016 UserApcPending   : UChar
